cf_billing/Documents/энргОбходнойЛистМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргОбходнойЛистМКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчетаМКД</xr:Item>
				<xr:Item>InformationRegister.энргМаксимальныеПоказанияМКД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоказаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргЗагрузкаПоказанийИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАбонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАдресАбонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьУслуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресАбонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВладельцыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВладельцыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АбонентВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргОбходнойЛистМКД/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОбходнойЛистМКД(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
		
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
			
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыШкал							= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент,Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД,СтандартнаяОбработка); 
КонецПроцедуры

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыНетТарифныхЗон";
	ИмяТаблицыПоказания						= "ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки,Неопределено,"ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#Область СобытияТаблицыФормыПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

#КонецОбласти



#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьПоказания(Команда)
	ЗаполнитьПоказанияНаСервере();
	//Если Объект.ТочкиУчета.Количество() > 0 тогда
	//	Элементы.ПоказанияПриборовУчета.ОтборСтрок = Новый ФиксированнаяСтруктура("IDСтроки",Объект.ТочкиУчета[0].IDСтроки)
	//КонецЕсли;   
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИфункции

&НаСервере
Процедура ЗаполнитьПоказанияНаСервере()
	
	МВТ  = Новый МенеджерВременныхТаблиц;
	ЗаполнитьМВТПоМаршруту(МВТ);	
	
	ТаблицаТЧ 								= Объект.ПоказанияПриборовУчета.Выгрузить(); 
	// очищаем табличную показания  	
	Объект.ШкалыПриборовУчета.Очистить();
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	
	// выводим данные по подключенным услугам и задолженности
	Результат 					= ДействующиеПриборыУчетаГруппыМКД(Объект.Дата,Объект.Организация,Объект.Район,МВТ); 
	Выборка  					= Результат.выбрать();
	ТекМКД						= Неопределено;
	ТекТочкаУчета 				= Неопределено;
	ТекШкала 					= Неопределено;
	IDСтрокиТочки 				= Неопределено;
	IDСтрокиШкалы 				= Неопределено;
	Пока Выборка.следующий() Цикл 
		НоваяТочка = Ложь;
		Если Не ТекМКД = Выборка.МКД Или НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.МКД 				= Выборка.МКД;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
			//СтрокаТочкиУчета.РегистрируетОбъем 	= Выборка.РегистрируетОбъем;
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона; 
		
		ТекМКД 						= Выборка.МКД;
		ТекТочкаУчета 				= Выборка.ТочкаУчета;
		ТекПрибор 					= Выборка.ПриборУчета;
		ТекШкала 					= Выборка.Шкала;
	
	КонецЦикла; 
	
	энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчетаМКД(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Неопределено,Ложь);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМВТПоМаршруту(МВТ)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",Объект.Район);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Маршрут",Объект.Маршрут);
	Запрос.Текст 	="ВЫБРАТЬ
	             	 |	энргМаршрутыКонтроллеровАдресаМаршрута.Представление КАК Представление
	             	 |ПОМЕСТИТЬ СписокАдресов
	             	 |ИЗ
	             	 |	Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	             	 |ГДЕ
	             	 |	энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка = &Маршрут
	             	 |;
	             	 |
	             	 |////////////////////////////////////////////////////////////////////////////////
	             	 |ВЫБРАТЬ
	             	 |	энргМногоквартирныеДомаКонтактнаяИнформация.Ссылка КАК Ссылка,
	             	 |	энргМногоквартирныеДомаКонтактнаяИнформация.Представление КАК Представление
	             	 |ПОМЕСТИТЬ АдресаМКД
	             	 |ИЗ
	             	 |	Справочник.энргСтроения.КонтактнаяИнформация КАК энргМногоквартирныеДомаКонтактнаяИнформация
	             	 |;
	             	 |
	             	 |////////////////////////////////////////////////////////////////////////////////
	             	 |ВЫБРАТЬ
	             	 |	АдресаМКД.Ссылка КАК МКД,
	             	 |	АдресаМКД.Представление КАК АдресМКД
	             	 |ПОМЕСТИТЬ втМКД
	             	 |ИЗ
	             	 |	СписокАдресов КАК СписокАдресов
	             	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АдресаМКД КАК АдресаМКД
	             	 |		ПО (АдресаМКД.Представление ПОДОБНО СписокАдресов.Представление + ""%"")";
	Результат  = Запрос.Выполнить();	
КонецПроцедуры

Функция ДействующиеПриборыУчетаГруппыМКД(Период,Организация,Район,МВТ) 
			
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Период",		Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Район",		Район);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргАктивностьТочекУчетаМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ АктивныеТочкиУчетаМКД
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И МКД В
	|					(ВЫБРАТЬ
	|						втМКД.МКД
	|					ИЗ
	|						втМКД КАК втМКД)
	|				И Район = &Район) КАК энргАктивностьТочекУчетаМКДСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец КАК АбонентВладелец
	|ПОМЕСТИТЬ ТочкиУчетаМКД
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаМКД.ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаМКД КАК АктивныеТочкиУчетаМКД)) КАК энргВладельцыТочекУчетаСрезПоследних
	|ГДЕ
	|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец В
	|			(ВЫБРАТЬ
	|				втМКД.МКД
	|			ИЗ
	|				втМКД КАК втМКД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочкиУчетаМКД.ТочкаУчета КАК ТочкаУчета,
	|	АктивныеТочкиУчетаМКД.МКД КАК МКД
	|ПОМЕСТИТЬ ДействующиеТочкиУчета
	|ИЗ
	|	АктивныеТочкиУчетаМКД КАК АктивныеТочкиУчетаМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиУчетаМКД КАК ТочкиУчетаМКД
	|		ПО АктивныеТочкиУчетаМКД.ТочкаУчета = ТочкиУчетаМКД.ТочкаУчета
	|			И АктивныеТочкиУчетаМКД.МКД = ТочкиУчетаМКД.АбонентВладелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПриборыТочекМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргПриборыТочекМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргПриборыТочекМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ ПриборыТочекМКД
	|ИЗ
	|	РегистрСведений.энргПриборыТочекМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД В
	|					(ВЫБРАТЬ
	|						втМКД.МКД
	|					ИЗ
	|						втМКД КАК втМКД)) КАК энргПриборыТочекМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыТочекМКД.ПриборУчета КАК ПриборУчета,
	|	ДействующиеТочкиУчета.МКД КАК МКД
	|ПОМЕСТИТЬ ПриборыДействующихТочекМКД
	|ИЗ
	|	ДействующиеТочкиУчета КАК ДействующиеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриборыТочекМКД КАК ПриборыТочекМКД
	|		ПО ДействующиеТочкиУчета.ТочкаУчета = ПриборыТочекМКД.ТочкаУчета
	|			И ДействующиеТочкиУчета.МКД = ПриборыТочекМКД.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеПриборовМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеПриборовМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргСостояниеПриборовМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ ВведенныеПриборыМКД
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД В
	|					(ВЫБРАТЬ
	|						втМКД.МКД
	|					ИЗ
	|						втМКД КАК втМКД)) КАК энргСостояниеПриборовМКДСрезПоследних
	|ГДЕ
	|	энргСостояниеПриборовМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргУслугиТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргУслугиТочекУчетаМКДСрезПоследних.Услуга КАК Услуга,
	|	энргУслугиТочекУчетаМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ УслугиТочекУчетаМКД
	|ИЗ
	|	РегистрСведений.энргУслугиТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД В
	|					(ВЫБРАТЬ
	|						втМКД.МКД
	|					ИЗ
	|						втМКД КАК втМКД)) КАК энргУслугиТочекУчетаМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПриборыУзловУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргПриборыУзловУчетаМКДСрезПоследних.УзелУчета КАК УзелУчета,
	|	энргПриборыУзловУчетаМКДСрезПоследних.ТипИзмерителя КАК ТипИзмерителя,
	|	энргПриборыУзловУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргПриборыУзловУчетаМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ ВТ_ПриборыУзловУчета
	|ИЗ
	|	РегистрСведений.энргПриборыУзловУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД В
	|					(ВЫБРАТЬ
	|						втМКД.МКД
	|					ИЗ
	|						втМКД КАК втМКД)
	|				И (ТочкаУчета, УзелУчета) В
	|					(ВЫБРАТЬ
	|						ВведенныеПриборыМКД.ТочкаУчета КАК ТочкаУчета,
	|						ВведенныеПриборыМКД.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ВведенныеПриборыМКД КАК ВведенныеПриборыМКД)) КАК энргПриборыУзловУчетаМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.УзелУчета КАК УзелУчета,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ ВТ_АктивныеПриборыУзловУчета
	|ИЗ
	|	ВТ_ПриборыУзловУчета КАК ВТ_ПриборыУзловУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеПриборовУзловУчетаМКД.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И МКД В
	|						(ВЫБРАТЬ
	|							втМКД.МКД
	|						ИЗ
	|							втМКД КАК втМКД)
	|					И (ТочкаУчета, УзелУчета, ТипИзмерителя, ПриборУчета) В
	|						(ВЫБРАТЬ
	|							ВТ_ПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|							ВТ_ПриборыУзловУчета.УзелУчета КАК УзелУчета,
	|							ВТ_ПриборыУзловУчета.ТипИзмерителя КАК ТипИзмерителя,
	|							ВТ_ПриборыУзловУчета.ПриборУчета КАК ПриборУчета
	|						ИЗ
	|							ВТ_ПриборыУзловУчета КАК ВТ_ПриборыУзловУчета)) КАК энргСостояниеПриборовУзловУчетаМКДСрезПоследних
	|		ПО ВТ_ПриборыУзловУчета.ТочкаУчета = энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ТочкаУчета
	|			И ВТ_ПриборыУзловУчета.УзелУчета = энргСостояниеПриборовУзловУчетаМКДСрезПоследних.УзелУчета
	|			И ВТ_ПриборыУзловУчета.ТипИзмерителя = энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ТипИзмерителя
	|			И ВТ_ПриборыУзловУчета.ПриборУчета = энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета
	|			И ВТ_ПриборыУзловУчета.МКД = энргСостояниеПриборовУзловУчетаМКДСрезПоследних.МКД
	|ГДЕ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыДифференцированностиПриборовУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргВидыДифференцированностиПриборовУчетаМКДСрезПоследних.Шкала КАК Шкала,
	|	энргВидыДифференцированностиПриборовУчетаМКДСрезПоследних.ВидДифференцированности КАК ВидДифференцированности,
	|	энргВидыДифференцированностиПриборовУчетаМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ ВидыДифференцированностиТочекУчетаМКД
	|ИЗ
	|	РегистрСведений.энргВидыДифференцированностиПриборовУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД В
	|					(ВЫБРАТЬ
	|						втМКД.МКД
	|					ИЗ
	|						втМКД КАК втМКД)) КАК энргВидыДифференцированностиПриборовУчетаМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|	ВложенныйЗапрос.МКД КАК МКД
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности,
	|		ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|		ВложенныйЗапрос.МКД КАК МКД
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|			ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|			ВТ_АктивныеПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|			ВложенныйЗапрос.МКД КАК МКД
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ПриборыДействующихТочекМКД.ТочкаУчета КАК ТочкаУчета,
	|				ПриборыДействующихТочекМКД.ПриборУчета КАК УзелУчета,
	|				ПриборыДействующихТочекМКД.МКД КАК МКД
	|			ИЗ
	|				ПриборыДействующихТочекМКД КАК ПриборыДействующихТочекМКД
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВведенныеПриборыМКД КАК ВведенныеПриборы
	|					ПО ПриборыДействующихТочекМКД.ПриборУчета = ВведенныеПриборы.ПриборУчета
	|						И ПриборыДействующихТочекМКД.ТочкаУчета = ВведенныеПриборы.ТочкаУчета
	|						И ПриборыДействующихТочекМКД.МКД = ВведенныеПриборы.МКД) КАК ВложенныйЗапрос
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктивныеПриборыУзловУчета КАК ВТ_АктивныеПриборыУзловУчета
	|				ПО ВложенныйЗапрос.ТочкаУчета = ВТ_АктивныеПриборыУзловУчета.ТочкаУчета
	|					И ВложенныйЗапрос.УзелУчета = ВТ_АктивныеПриборыУзловУчета.УзелУчета
	|					И ВложенныйЗапрос.МКД = ВТ_АктивныеПриборыУзловУчета.МКД) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ПО ВложенныйЗапрос.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПараметрыИзмерителейСрезПоследних.Измеритель КАК Измеритель,
	|	бестПараметрыИзмерителейСрезПоследних.ВидПараметра КАК ВидПараметра,
	|	бестПараметрыИзмерителейСрезПоследних.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	бестПараметрыИзмерителейСрезПоследних.Шкала КАК Шкала
	|ПОМЕСТИТЬ ВТ_ПараметрыИзмерителей
	|ИЗ
	|	РегистрСведений.бестПараметрыИзмерителей.СрезПоследних(
	|			&Период,
	|			Измеритель В
	|				(ВЫБРАТЬ
	|					ДанныеПоПриборам.ПриборУчета КАК ПриборУчета
	|				ИЗ
	|					ДанныеПоПриборам КАК ДанныеПоПриборам)) КАК бестПараметрыИзмерителейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|	Вложенныйзапрос.Шкала КАК Шкала,
	|	Вложенныйзапрос.Услуга КАК Услуга,
	|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Вложенныйзапрос.УзелУчета КАК УзелУчета,
	|	Вложенныйзапрос.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВТ_ПараметрыИзмерителей.ВидПараметра КАК ВидПараметра,
	|	ВТ_ПараметрыИзмерителей.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	Вложенныйзапрос.МКД КАК МКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|		ДанныеПоПриборам.Шкала КАК Шкала,
	|		ЕСТЬNULL(УслугиТочекУчетаМКД.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|		ЕСТЬNULL(ВидыДифференцированностиТочекУчетаМКД.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
	|		ДанныеПоПриборам.УзелУчета КАК УзелУчета,
	|		ДанныеПоПриборам.МКД КАК МКД
	|	ИЗ
	|		ДанныеПоПриборам КАК ДанныеПоПриборам
	|			ЛЕВОЕ СОЕДИНЕНИЕ УслугиТочекУчетаМКД КАК УслугиТочекУчетаМКД
	|			ПО ДанныеПоПриборам.ТочкаУчета = УслугиТочекУчетаМКД.ТочкаУчета
	|				И ДанныеПоПриборам.МКД = УслугиТочекУчетаМКД.МКД
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВидыДифференцированностиТочекУчетаМКД КАК ВидыДифференцированностиТочекУчетаМКД
	|			ПО ДанныеПоПриборам.ПриборУчета = ВидыДифференцированностиТочекУчетаМКД.ПриборУчета
	|				И ДанныеПоПриборам.Шкала = ВидыДифференцированностиТочекУчетаМКД.Шкала) КАК Вложенныйзапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыИзмерителей КАК ВТ_ПараметрыИзмерителей
	|		ПО Вложенныйзапрос.ПриборУчета = ВТ_ПараметрыИзмерителей.Измеритель
	|			И Вложенныйзапрос.Шкала = ВТ_ПараметрыИзмерителей.Шкала
	|
	|УПОРЯДОЧИТЬ ПО
	|	МКД,
	|	Вложенныйзапрос.ТочкаУчета,
	|	Вложенныйзапрос.Шкала";	
	Результат  = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПересчитатьСтрокуПриборовУчета(ДанныеСтроки  = Неопределено)
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные;
	Иначе	
		текСтрока 								= Элементы.ТочкиУчетаНетШкалНетТарифныхЗон.ТекущиеДанные;
	КонецЕсли;
	
	Если текСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ДанныеСтроки <>Неопределено тогда
		ЗаполнитьЗначенияСвойств(текСтрока,ДанныеСтроки);
	КонецЕсли;
	
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчетаМКД(текСтрока,Объект.Дата,Ложь);	
	
	Если текСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены"); 		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ТочкиУчетаАбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент,Объект.Организация,Объект.Район,ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка"),СтандартнаяОбработка);	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ТочкиУчетаВидДифференцированностиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТочкиУчета.ТекущиеДанные;
	ТочкиУчетаВидДифференцированностиПриИзмененииНаСервере(ТекущаяСтрока.IDСтроки, ТекущаяСтрока.ВидДифференцированности);
	ОтборВТарифныхЗонах(ТекущаяСтрока.IDСтроки);
КонецПроцедуры

&НаСервере
Процедура ТочкиУчетаВидДифференцированностиПриИзмененииНаСервере(Ключ, ВидДифференцированности)
	УдалитьСтрокиВТарифныеЗоныПоКлючу(Ключ);
	ЗаполнитьТарифныеЗоныПоВидуДифференцированности(Объект.ПоказанияПриборовУчета, Ключ, ВидДифференцированности);
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиВТарифныеЗоныПоКлючу(Ключ)
	энргРаботаСПриборамиУчетаСервер.УдалитьСтрокиВТарифныеЗоныПоКлючу(Ключ, Объект.ПоказанияПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТарифныеЗоныПоВидуДифференцированности(ТЧ, Ключ, ВидДифференцированности)
	
	СписокТарифныхЗон = энргРаботаСПриборамиУчетаСервер.ПолучитьТарифныеЗоныПоВидуДифференцированности(ВидДифференцированности);
	
	Для каждого стр из СписокТарифныхЗон Цикл
		НовСтрока 				= ТЧ.Добавить();
		НовСтрока.IDСтроки	= Ключ;
		НовСтрока.ТарифнаяЗона 	= стр.ТарифнаяЗона;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВТарифныхЗонах(КлючСтроки)
	Отбор = Новый Структура;
	Отбор.Вставить("IDСтроки", КлючСтроки);
	Элементы.ПоказанияПриборовУчета.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаАбонентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТочкиУчета.ТекущиеДанные;

КонецПроцедуры

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТекДанные 								= Элементы.ТочкиУчета.ТекущиеДанные;
	// энргРаботаСВидомДифференцированности {
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	Иначе 
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПоказанияПриборовУчета, Неопределено,ТекДанные.IDСтроки); 
	
	КонецЕсли;
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока  = Элементы.ТочкиУчета.ТекущиеДанные; 	
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент,Объект.Дата,Объект.Организация,Объект.Район,ТекСтрока.МКД,СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиПоказанияПриборовУчета

&НаКлиенте
Процедура ПриборыУчетаТекущиеПоказанияПриИзменении(Элемент)
	текСтрока  = Элементы.ПоказанияПриборовУчета.ТекущиеДанные;
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока,Объект.ПериодНачисления,Истина);
	Если текСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены");		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПереворотПриИзменении(Элемент)
	текСтрока								= Элементы.ПоказанияПриборовУчета.ТекущиеДанные;
	текСтрока.ПереворотИзмененПользователем	= Истина;
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока,Объект.Дата,Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаСостояниеПоказанийПриИзменении(Элемент)
	текСтрока								= Элементы.ПоказанияПриборовУчета.ТекущиеДанные;
	текСтрока.СтатусИзмененПользователем	= Истина;
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока,Объект.Дата,Ложь);
КонецПроцедуры

#КонецОбласти
